app/controllers/articles_controller.rb

  def update
    # raise params.inspect
    # binding.pry
      @article = Article.find(params[:id])
      # @article.update(title: params[:article][:title], description: params[:article][:description])
      @article.title = params[:article][:title]
      @article.description = params[:article][:description]
      @article.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-04-25 04:39:24.659154"], ["id", 1]]